app/controllers/customers_controller.rb

SELECT "customers".* FROM "customers"  ORDER BY "customers"."name" ASC
---
  def index
    @customers = Customer.all.order(:name)

INSERT INTO "customers" ("name", "email", "account_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Bob Dobbs"], ["email", "bob@dobbs.com"], ["account_type", "Free"], ["created_at", "2016-08-29 23:34:57.421943"], ["updated_at", "2016-08-29 23:34:57.421943"]]
---
  def create
    @customer = Customer.new(customer_params)
    if @customer.save

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "customers" SET "name" = ?, "email" = ?, "account_type" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["name", "Wurb Flathead"], ["email", "wurb@frobozz.com"], ["account_type", "Premium"], ["updated_at", "2016-08-29 22:44:20.484527"], ["id", 1]]
---
  def update
    @customer = Customer.find(params[:id])
    # SQL: SELECT * FROM customers WHERE customers.id = ? LIMIT 1
    if @customer.update_attributes(customer_params)

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "customers" WHERE "customers"."id" = ?  [["id", 1]]
---
  def destroy
    @customer = Customer.find(params[:id])
    # SQL: SELECT * FROM customers WHERE customers.id = ? LIMIT 1
    if @customer.destroy