app/controllers/logs_controller.rb

  def index
    @logs = Log.all.order("created_at DESC")
---
SELECT "logs".* FROM "logs"  ORDER BY created_at DESC

  def create
    @log = Log.new(log_params)
    if @log.save
---
INSERT INTO "logs" ("user_id", "customer_id", "summary", "duration", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["customer_id", 6], ["summary", "I like pie."], ["duration", 100], ["created_at", "2016-08-29 23:29:41.049357"], ["updated_at", "2016-08-29 23:29:41.049357"]]