app/views/logs/new.html.erb

SELECT "users".* FROM "users"
---
      <th>User</th>
      <td><%= f.select :user_id, User.all.map { |u| [u.name, u.id] } %></td>

SELECT "customers".* FROM "customers"
---
      <th>Customer</th>
      <td><%= f.select :customer_id, Customer.all.map { |c| [c.name, c.id] } %></td>